perf_testing/data/composePost/202404261305_650_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 127.118ms, rate sampling interval: 392ms
  Thread calibration: mean lat.: 125.245ms, rate sampling interval: 385ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.93s     3.54s   16.01s    81.03%
    Req/Sec   261.74     61.14   382.00     68.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  143.10ms
 75.000%  416.77ms
 90.000%    8.02s 
 99.000%   16.01s 
 99.900%   19.55s 
 99.990%   19.91s 
 99.999%   19.96s 
100.000%   19.96s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      16.031     0.000000            1         1.00
      90.623     0.100000         1049         1.11
      96.063     0.200000         2108         1.25
     101.887     0.300000         3149         1.43
     115.263     0.400000         4198         1.67
     143.103     0.500000         5246         2.00
     161.663     0.550000         5771         2.22
     195.071     0.600000         6294         2.50
     233.855     0.650000         6818         2.86
     302.591     0.700000         7344         3.33
     416.767     0.750000         7867         4.00
    2891.775     0.775000         8129         4.44
    4886.527     0.800000         8391         5.00
    5918.719     0.825000         8653         5.71
    6627.327     0.850000         8916         6.67
    7286.783     0.875000         9177         8.00
    7688.191     0.887500         9311         8.89
    8019.967     0.900000         9440        10.00
    8372.223     0.912500         9572        11.43
    8757.247     0.925000         9705        13.33
    9068.543     0.937500         9834        16.00
    9207.807     0.943750         9900        17.78
    9355.263     0.950000         9965        20.00
    9527.295     0.956250        10030        22.86
    9674.751     0.962500        10095        26.67
    9805.823     0.968750        10162        32.00
    9879.551     0.971875        10195        35.56
    9953.279     0.975000        10229        40.00
   10018.815     0.978125        10265        45.71
   10076.159     0.981250        10300        53.33
   10174.463     0.984375        10327        64.00
   14360.575     0.985938        10341        71.11
   15155.199     0.987500        10357        80.00
   15695.871     0.989062        10374        91.43
   16195.583     0.990625        10391       106.67
   16613.375     0.992188        10407       128.00
   16908.287     0.992969        10415       142.22
   17154.047     0.993750        10423       160.00
   17383.423     0.994531        10431       182.86
   17678.335     0.995313        10439       213.33
   18006.015     0.996094        10448       256.00
   18153.471     0.996484        10452       284.44
   18317.311     0.996875        10456       320.00
   18464.767     0.997266        10460       365.71
   18595.839     0.997656        10464       426.67
   18825.215     0.998047        10468       512.00
   18989.055     0.998242        10470       568.89
   19136.511     0.998437        10472       640.00
   19267.583     0.998633        10474       731.43
   19431.423     0.998828        10476       853.33
   19546.111     0.999023        10478      1024.00
   19578.879     0.999121        10479      1137.78
   19628.031     0.999219        10480      1280.00
   19644.415     0.999316        10481      1462.86
   19693.567     0.999414        10482      1706.67
   19726.335     0.999512        10483      2048.00
   19791.871     0.999561        10485      2275.56
   19791.871     0.999609        10485      2560.00
   19791.871     0.999658        10485      2925.71
   19791.871     0.999707        10485      3413.33
   19841.023     0.999756        10486      4096.00
   19841.023     0.999780        10486      4551.11
   19841.023     0.999805        10486      5120.00
   19906.559     0.999829        10487      5851.43
   19906.559     0.999854        10487      6826.67
   19906.559     0.999878        10487      8192.00
   19906.559     0.999890        10487      9102.22
   19906.559     0.999902        10487     10240.00
   19955.711     0.999915        10488     11702.86
   19955.711     1.000000        10488          inf
#[Mean    =     1928.395, StdDeviation   =     3544.638]
#[Max     =    19939.328, Total count    =        10488]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  15697 requests in 30.00s, 4.24MB read
  Non-2xx or 3xx responses: 35
Requests/sec:    523.16  
Transfer/sec:    144.87KB