perf_testing/data/composePost/202404261339_1450_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 2640.294ms, rate sampling interval: 9060ms
  Thread calibration: mean lat.: 2732.668ms, rate sampling interval: 9281ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.63s     2.73s   17.19s    70.75%
    Req/Sec   311.00     25.72   344.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.43s 
 75.000%    9.95s 
 90.000%   11.72s 
 99.000%   17.19s 
 99.900%   18.42s 
 99.990%   18.69s 
 99.999%   18.71s 
100.000%   18.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4069.375     0.000000            1         1.00
    5373.951     0.100000         1225         1.11
    6115.327     0.200000         2449         1.25
    7077.887     0.300000         3664         1.43
    7819.263     0.400000         4890         1.67
    8429.567     0.500000         6108         2.00
    8732.671     0.550000         6744         2.22
    9019.391     0.600000         7333         2.50
    9289.727     0.650000         7944         2.86
    9584.639     0.700000         8554         3.33
    9945.087     0.750000         9167         4.00
   10182.655     0.775000         9471         4.44
   10395.647     0.800000         9783         5.00
   10665.983     0.825000        10084         5.71
   10911.743     0.850000        10386         6.67
   11231.231     0.875000        10687         8.00
   11468.799     0.887500        10841         8.89
   11722.751     0.900000        10996        10.00
   12066.815     0.912500        11148        11.43
   12541.951     0.925000        11298        13.33
   13656.063     0.937500        11450        16.00
   14123.007     0.943750        11527        17.78
   14565.375     0.950000        11603        20.00
   15138.815     0.956250        11681        22.86
   15425.535     0.962500        11757        26.67
   15753.215     0.968750        11832        32.00
   15900.671     0.971875        11870        35.56
   16080.895     0.975000        11912        40.00
   16277.503     0.978125        11947        45.71
   16482.303     0.981250        11985        53.33
   16678.911     0.984375        12023        64.00
   16809.983     0.985938        12042        71.11
   16891.903     0.987500        12061        80.00
   17072.127     0.989062        12080        91.43
   17252.351     0.990625        12102       106.67
   17350.655     0.992188        12118       128.00
   17448.959     0.992969        12129       142.22
   17514.495     0.993750        12137       160.00
   17661.951     0.994531        12148       182.86
   17743.871     0.995313        12156       213.33
   17858.559     0.996094        12168       256.00
   17907.711     0.996484        12175       284.44
   17907.711     0.996875        12175       320.00
   18006.015     0.997266        12180       365.71
   18087.935     0.997656        12187       426.67
   18137.087     0.998047        12190       512.00
   18202.623     0.998242        12192       568.89
   18235.391     0.998437        12194       640.00
   18317.311     0.998633        12197       731.43
   18350.079     0.998828        12199       853.33
   18431.999     0.999023        12202      1024.00
   18448.383     0.999121        12203      1137.78
   18497.535     0.999219        12204      1280.00
   18513.919     0.999316        12205      1462.86
   18530.303     0.999414        12206      1706.67
   18579.455     0.999512        12208      2048.00
   18579.455     0.999561        12208      2275.56
   18644.991     0.999609        12210      2560.00
   18644.991     0.999658        12210      2925.71
   18644.991     0.999707        12210      3413.33
   18694.143     0.999756        12212      4096.00
   18694.143     0.999780        12212      4551.11
   18694.143     0.999805        12212      5120.00
   18694.143     0.999829        12212      5851.43
   18694.143     0.999854        12212      6826.67
   18694.143     0.999878        12212      8192.00
   18694.143     0.999890        12212      9102.22
   18694.143     0.999902        12212     10240.00
   18694.143     0.999915        12212     11702.86
   18710.527     0.999927        12213     13653.33
   18710.527     1.000000        12213          inf
#[Mean    =     8630.835, StdDeviation   =     2729.935]
#[Max     =    18694.144, Total count    =        12213]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17529 requests in 30.00s, 4.75MB read
  Non-2xx or 3xx responses: 185
Requests/sec:    584.25  
Transfer/sec:    161.99KB